In [198]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [199]:
train=pd.read_csv(r"C:\Users\jakha\Downloads\Train_cars.csv")
test=pd.read_csv(r"C:\Users\jakha\Downloads\Test_cars.csv")
submisiondata=pd.read_csv(r"C:\Users\jakha\Downloads\Sample_Submission (2).csv")

In [200]:
train.head(2)

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,Maruti 800 Std BSIII,Bangalore,2012,33715,Diesel,Manual,First,16.46 kmpl,1248 CC,100 bhp,5.0,43.65 Lakh,25.53
1,Honda City 1.5 V AT,Delhi,2013,73977,Diesel,Manual,First,18.6 kmpl,2993 CC,61 bhp,4.0,NaN,4.58

In [201]:
combineddata=train.append(test)

In [202]:
combineddata.shape

(75000, 13)

In [203]:
#lets  start with Name column
combineddata['companyname']=combineddata.Name.apply(lambda x: x.split()[0])

In [204]:
combineddata.head(2)

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,companyname
0,Maruti 800 Std BSIII,Bangalore,2012,33715,Diesel,Manual,First,16.46 kmpl,1248 CC,100 bhp,5.0,43.65 Lakh,25.53,Maruti
1,Honda City 1.5 V AT,Delhi,2013,73977,Diesel,Manual,First,18.6 kmpl,2993 CC,61 bhp,4.0,NaN,4.58,Honda

In [205]:
combineddata.drop("Name",axis=1,inplace=True)

In [206]:
combineddata.Location.unique()

array(['Bangalore', 'Delhi', 'Kolkata', 'Coimbatore', 'Pune', 'Hyderabad',
       'Mumbai', 'Kochi', 'Chennai', 'Jaipur', 'Ahmedabad'], dtype=object)

In [207]:
combineddata.Location.value_counts([0])

Mumbai        0.192427
Hyderabad     0.171587
Kolkata       0.153747
Chennai       0.104387
Jaipur        0.078853
Delhi         0.065787
Bangalore     0.058320
Kochi         0.049653
Coimbatore    0.048027
Pune          0.045760
Ahmedabad     0.031453
Name: Location, dtype: float64

combineddata.Location.replace({'Bangalore':'south', 'Delhi':'north', 'Kolkata':'east', 'Coimbatore':'south', 'Pune':'south',
                            'Hyderabad':1,'Mumbai':2, 'Kochi':0, 'Chennai':2, 'Jaipur':0,
                               'Ahmedabad':1},inplace=True)

In [208]:
combineddata['age']=2022-combineddata.Year

In [209]:
combineddata.drop("Year",inplace=True,axis=1)

In [210]:
combineddata.head()

,Location,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,companyname,age
0,Bangalore,33715,Diesel,Manual,First,16.46 kmpl,1248 CC,100 bhp,5.0,43.65 Lakh,25.53,Maruti,10
1,Delhi,73977,Diesel,Manual,First,18.6 kmpl,2993 CC,61 bhp,4.0,NaN,4.58,Honda,9
2,Delhi,16460,CNG,Manual,Third,15.3 kmpl,1599 CC,140 bhp,5.0,NaN,2.37,Honda,15
3,Kolkata,35048,Petrol,Manual,First,25.47 kmpl,1196 CC,86.8 bhp,5.0,NaN,1.20,Skoda,13
4,Coimbatore,41656,Petrol,Automatic,First,19.12 kmpl,1999 CC,115 bhp,7.0,13.26 Lakh,33.04,Hyundai,9

combineddata.Fuel_Type.replace({'Diesel':4, 'CNG':2, 'Petrol':3, 'LPG':1, 'Electric':0},inplace=True)

In [211]:
combineddata.Transmission.replace({'Manual':0, 'Automatic':1},inplace=True)

In [212]:
combineddata.Owner_Type.replace({'First':1, 'Third':3, 'Second':2, 'Fourth & Above':4},inplace=True)

In [213]:
combineddata.Mileage=combineddata.Mileage.apply(lambda x:str( x).split()[0])

In [214]:
combineddata.Mileage=combineddata.Mileage.astype(np.number)

In [215]:
combineddata.Mileage.fillna(combineddata.Mileage.mean(),inplace=True)

In [216]:
combineddata.Engine=combineddata.Engine.apply(lambda x:str( x).split()[0])

In [217]:
combineddata.Engine=combineddata.Engine.astype(np.number)

In [218]:
combineddata.Engine.fillna(int(combineddata.Engine.mode()[0]),inplace=True)

In [219]:
combineddata.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 75000 entries, 0 to 52499
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Location           75000 non-null  object
 1   Kilometers_Driven  75000 non-null  int64
 2   Fuel_Type          75000 non-null  object
 3   Transmission       75000 non-null  int64
 4   Owner_Type         75000 non-null  int64
 5   Mileage            75000 non-null  float64
 6   Engine             75000 non-null  float64
 7   Power              74683 non-null  object
 8   Seats              74662 non-null  float64
 9   New_Price          13066 non-null  object
 10  Price              22500 non-null  float64
 11  companyname        75000 non-null  object
 12  age                75000 non-null  int64
dtypes: float64(4), int64(4), object(5)
memory usage: 8.0+ MB

In [220]:
combineddata.Power=combineddata.Power.apply(lambda x:str( x).split()[0])

In [221]:
combineddata.Power.replace({'null':60,'nan':60},inplace=True)

In [222]:
combineddata.Power=combineddata.Power.astype(np.number)

In [223]:
combineddata.Seats.fillna(combineddata.Seats.mode()[0],inplace=True)

In [224]:
combineddata.isnull().sum()

Location                 0
Kilometers_Driven        0
Fuel_Type                0
Transmission             0
Owner_Type               0
Mileage                  0
Engine                   0
Power                    0
Seats                    0
New_Price            61934
Price                52500
companyname              0
age                      0
dtype: int64

In [225]:
def func(x):
    if 'Cr'in str(x).split():
        a= (x.split()[0])
        a=float(a)*100
        return a
    elif 'Lakh' in str(x).split():
        return (x.split()[0])
    else:
        return 0

In [226]:
combineddata.New_Price.fillna(0,inplace=True)

In [227]:
combineddata.New_Price=combineddata.New_Price.apply(func)

In [228]:
combineddata.New_Price.replace({0:np.nan},inplace=True)

In [229]:
combineddata.New_Price

0        43.65
1          NaN
2          NaN
3          NaN
4        13.26
         ...
52495      NaN
52496    136.0
52497    10.04
52498      NaN
52499      NaN
Name: New_Price, Length: 75000, dtype: object

In [230]:
combineddata.groupby("companyname")["New_Price"].median()

C:\Users\jakha\Anaconda3\lib\site-packages\numpy\lib\nanfunctions.py:1111: RuntimeWarning: Mean of empty slice
  return np.nanmean(a, axis, out=out, keepdims=keepdims)

companyname
Audi              9.09
BMW               9.14
Bentley            NaN
Chevrolet         8.61
Datsun           12.67
Fiat             11.15
Force            12.34
Ford              8.69
Honda             9.79
Hyundai           9.19
ISUZU             8.61
Isuzu            11.81
Jaguar            8.61
Jeep              8.61
Land              8.61
Mahindra         10.41
Maruti            8.68
Mercedes-Benz    10.26
Mini              8.61
Mitsubishi       13.08
Nissan            8.61
Porsche           8.61
Renault           9.79
Skoda            10.90
Tata              8.61
Toyota           10.30
Volkswagen       10.13
Volvo            11.11
Name: New_Price, dtype: float64

In [231]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Audi'),"New_Price"]=9.09

In [232]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='BMW'),"New_Price"]=9.14

In [233]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Bentley'),"New_Price"]=10.0

In [234]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Chevrolet'),"New_Price"]=8.61

In [235]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Datsun'),"New_Price"]=12.67

In [236]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Fiat'),"New_Price"]=11.15

In [237]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Force'),"New_Price"]=12.34

In [238]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Ford'),"New_Price"]=8.69

In [239]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Honda'),"New_Price"]=9.79

In [240]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Hyundai'),"New_Price"]=9.19

In [241]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='ISUZU'),"New_Price"]=10

In [242]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Isuzu'),"New_Price"]=10

In [243]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Jaguar'),"New_Price"]=8.61

In [244]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Jeep'),"New_Price"]=8.61

In [245]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Land'),"New_Price"]=8.61

In [246]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Mahindra'),"New_Price"]=10.41

In [247]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Maruti'),"New_Price"]=8.68

In [248]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Mercedes-Benz'),"New_Price"]=10.26

In [249]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Mini'),"New_Price"]=8.61

In [250]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Mitsubishi'),"New_Price"]=13.08

In [251]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Nissan'),"New_Price"]=8.61

In [252]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Porsche'),"New_Price"]=8.61

In [253]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Renault'),"New_Price"]=9.79

In [254]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Skoda'),"New_Price"]=10.90

In [255]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Tata'),"New_Price"]=8.61

In [256]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Toyota'),"New_Price"]=10.13

In [257]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Volkswagen'),"New_Price"]=10.13

In [258]:
combineddata.loc[(combineddata.New_Price.isnull())&(combineddata.companyname=='Volvo'),"New_Price"]=11.08

In [259]:
combineddata.isnull().sum()

Location                 0
Kilometers_Driven        0
Fuel_Type                0
Transmission             0
Owner_Type               0
Mileage                  0
Engine                   0
Power                    0
Seats                    0
New_Price                0
Price                52500
companyname              0
age                      0
dtype: int64

In [260]:
combineddata.isnull().sum()/len(combineddata)

Location             0.0
Kilometers_Driven    0.0
Fuel_Type            0.0
Transmission         0.0
Owner_Type           0.0
Mileage              0.0
Engine               0.0
Power                0.0
Seats                0.0
New_Price            0.0
Price                0.7
companyname          0.0
age                  0.0
dtype: float64

In [261]:
combineddata.head()

,Location,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,companyname,age
0,Bangalore,33715,Diesel,0,1,16.46,1248.0,100.0,5.0,43.65,25.53,Maruti,10
1,Delhi,73977,Diesel,0,1,18.60,2993.0,61.0,4.0,9.79,4.58,Honda,9
2,Delhi,16460,CNG,0,3,15.30,1599.0,140.0,5.0,9.79,2.37,Honda,15
3,Kolkata,35048,Petrol,0,1,25.47,1196.0,86.8,5.0,10.9,1.20,Skoda,13
4,Coimbatore,41656,Petrol,1,1,19.12,1999.0,115.0,7.0,13.26,33.04,Hyundai,9

In [262]:
combineddata.companyname.nunique()

28

In [263]:
combineddata.Kilometers_Driven.describe()

count     75000.000000
mean      48859.175787
std       21583.406967
min         171.000000
25%       35710.750000
50%       47861.000000
75%       59548.250000
max      255022.000000
Name: Kilometers_Driven, dtype: float64

In [264]:
def kd(x):
    if x<30000:
        return 3
    elif x<50000:
        return 2
    elif x<70000:
        return 1
    else :
        return 0

In [265]:
combineddata.Kilometers_Driven=combineddata.Kilometers_Driven.apply(kd)

In [266]:
combineddata.Mileage.describe()

count    75000.000000
mean        18.294160
std          5.037614
min          0.000000
25%         14.670000
50%         17.880000
75%         21.760000
max         33.540000
Name: Mileage, dtype: float64

In [267]:
def M(x):
    if x<10:
        return 0
    elif x<20:
        return 1
    else:
        return 2

In [268]:
combineddata.Mileage=combineddata.Mileage.apply(M)

In [269]:
combineddata.Engine.describe()

count    75000.000000
mean      1640.778093
std        670.137643
min         72.000000
25%       1197.000000
50%       1495.000000
75%       1995.000000
max       5998.000000
Name: Engine, dtype: float64

In [270]:
def e(x):
    if x<1000:
        return 1000
    else :
        return x

In [271]:
combineddata.Engine=combineddata.Engine.apply(e)

In [272]:
combineddata.head(2)

,Location,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,companyname,age
0,Bangalore,2,Diesel,0,1,1,1248.0,100.0,5.0,43.65,25.53,Maruti,10
1,Delhi,0,Diesel,0,1,1,2993.0,61.0,4.0,9.79,4.58,Honda,9

In [273]:
combineddata.Power.describe()

count    75000.000000
mean       114.737051
std         64.290848
min         34.200000
25%         69.010000
50%         90.000000
75%        140.000000
max        560.000000
Name: Power, dtype: float64

In [274]:
def p(x):
    if x<50:
        return 0
    elif x<100:
        return 1
    else:
        return 2

In [275]:
combineddata.Power=combineddata.Power.apply(p)

combineddata.companyname.replace({'Maruti':0, 'Honda':0, 'Skoda':2, 'Hyundai':0, 'Mercedes-Benz':4, 
                                 'Toyota':1,'Renault':0, 'Force':1, 'Ford':1, 'Fiat':2,
                                 'Volkswagen':0, 'Mahindra':1,'BMW':4, 'Mini':2, 'Tata':1,
                                 'Audi':4, 'Nissan':1, 'Land':4, 'Volvo':4,'Mitsubishi':3, 'ISUZU':1,
                                 'Chevrolet':0, 'Jaguar':4, 'Porsche':4, 'Datsun':0,'Jeep':3,
                                 'Isuzu':1, 'Bentley':4},inplace=True)

mapp=combineddata.companyname.value_counts([0])
combineddata.companyname=combineddata.companyname.map(mapp)

In [276]:
combineddata.head(2)

,Location,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,companyname,age
0,Bangalore,2,Diesel,0,1,1,1248.0,2,5.0,43.65,25.53,Maruti,10
1,Delhi,0,Diesel,0,1,1,2993.0,1,4.0,9.79,4.58,Honda,9

In [277]:
combineddata.isnull().sum()

Location                 0
Kilometers_Driven        0
Fuel_Type                0
Transmission             0
Owner_Type               0
Mileage                  0
Engine                   0
Power                    0
Seats                    0
New_Price                0
Price                52500
companyname              0
age                      0
dtype: int64

combineddata.age.replace({10:12,  9:13, 15:7, 13:9, 11:11, 12:10,  6:16,  5:17,  8:14,  7:15, 14:8,18:4, 19:3, 16:6,17:5,  4:18, 20:2,21:1,22:0},inplace=True)

In [278]:
combineddata.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 75000 entries, 0 to 52499
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Location           75000 non-null  object
 1   Kilometers_Driven  75000 non-null  int64
 2   Fuel_Type          75000 non-null  object
 3   Transmission       75000 non-null  int64
 4   Owner_Type         75000 non-null  int64
 5   Mileage            75000 non-null  int64
 6   Engine             75000 non-null  float64
 7   Power              75000 non-null  int64
 8   Seats              75000 non-null  float64
 9   New_Price          75000 non-null  object
 10  Price              22500 non-null  float64
 11  companyname        75000 non-null  object
 12  age                75000 non-null  int64
dtypes: float64(3), int64(6), object(4)
memory usage: 8.0+ MB

In [279]:
combineddata.New_Price=combineddata.New_Price.astype(np.number)

In [280]:
combineddata.drop(["Location","Fuel_Type","Owner_Type","companyname"],axis=1,inplace=True)

In [281]:
combineddata=pd.get_dummies(combineddata,drop_first=True)

In [282]:
train_data=combineddata.loc[~combineddata.Price.isnull(),:]

In [283]:
test_data=combineddata.loc[combineddata.Price.isnull(),:]

In [284]:
test_data.drop('Price',axis=1,inplace=True)

C:\Users\jakha\Anaconda3\lib\site-packages\pandas\core\frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

from sklearn.preprocessing import StandardScaler
sc=StandardScaler()
test_data[['Mileage','Engine','Power','Kilometers_Driven']]=sc.fit_transform(test_data[['Mileage','Engine','Power','Kilometers_Driven']])

train_data[['Mileage','Engine','Power','Kilometers_Driven']]=sc.transform(train_data[['Mileage','Engine','Power','Kilometers_Driven']])

train_data[['Mileage','Engine','Power']]

from yellowbrick.cluster import KElbowVisualizer
from sklearn.cluster import KMeans

kel=KElbowVisualizer(estimator=KMeans(),k=(2,10))
kel.fit(test_data)
kel.show()

km=KMeans(4)
km.fit(test_data)
train_data['labels']=km.predict(train_data.drop(["Price"],axis=1))

test_data['labels']=km.predict(test_data)

In [285]:
X=train_data.drop("Price",axis=1)
y=train_data.Price

#SMOTING
from imblearn.over_sampling import SMOTE
s=SMOTE()

xtrsm,labtrsm=s.fit_resample(train_data.drop("labels",axis=1),train_data.labels)

xtrsm["labels"]=labtrsm

xtrsm

In [286]:
train_data.shape

(22500, 9)

In [287]:
# Model Building

In [288]:
X.columns

Index(['Kilometers_Driven', 'Transmission', 'Mileage', 'Engine', 'Power',
       'Seats', 'New_Price', 'age'],
      dtype='object')

In [289]:
import statsmodels.api as sm
X['const']=1
test_data['const']=1
model=sm.OLS(y,X).fit()
model.summary()

C:\Users\jakha\AppData\Local\Temp/ipykernel_1960/2292543256.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  test_data['const']=1

<class 'statsmodels.iolib.summary.Summary'>
"""
                            OLS Regression Results
==============================================================================
Dep. Variable:                  Price   R-squared:                       0.148
Model:                            OLS   Adj. R-squared:                  0.148
Method:                 Least Squares   F-statistic:                     488.5
Date:                Sat, 01 Oct 2022   Prob (F-statistic):               0.00
Time:                        21:22:18   Log-Likelihood:                -74859.
No. Observations:               22500   AIC:                         1.497e+05
Df Residuals:                   22491   BIC:                         1.498e+05
Df Model:                           8
Covariance Type:            nonrobust
=====================================================================================
                        coef    std err          t      P>|t|      [0.025      0.975]
-------------------------------------------------------------------------------------
Kilometers_Driven     0.1672      0.052      3.241      0.001       0.066       0.268
Transmission          3.8912      0.118     32.921      0.000       3.660       4.123
Mileage              -0.2452      0.088     -2.788      0.005      -0.418      -0.073
Engine                0.0015   7.16e-05     21.171      0.000       0.001       0.002
Power                 1.0486      0.083     12.613      0.000       0.886       1.212
Seats                 1.4951      0.055     27.416      0.000       1.388       1.602
New_Price             0.0147      0.004      3.687      0.000       0.007       0.023
age                  -0.1270      0.017     -7.302      0.000      -0.161      -0.093
const                -5.2299      0.412    -12.703      0.000      -6.037      -4.423
==============================================================================
Omnibus:                    13974.470   Durbin-Watson:                   2.013
Prob(Omnibus):                  0.000   Jarque-Bera (JB):           168648.779
Skew:                           2.844   Prob(JB):                         0.00
Kurtosis:                      15.147   Cond. No.                     1.64e+04
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
[2] The condition number is large, 1.64e+04. This might indicate that there are
strong multicollinearity or other numerical problems.
"""

In [290]:
from sklearn.metrics import mean_squared_error

In [291]:
np.sqrt(mean_squared_error(y,model.predict(X)))

6.740490080171998

In [194]:
submisiondata.Price=model.predict(test_data)

In [295]:
submisiondata.to_csv("carprice.csv",index=False)

In [196]:
X.drop("const",axis=1,inplace=True)
test_data.drop("const",axis=1,inplace=True)

C:\Users\jakha\Anaconda3\lib\site-packages\pandas\core\frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [197]:
y1=xtrsm.Price
x1=xtrsm.drop("Price",axis=1)

NameError: name 'xtrsm' is not defined

In [293]:
from sklearn.tree import DecisionTreeRegressor
dct=DecisionTreeRegressor()

dct.fit(X,y)
mean_squared_error(y,dct.predict(X))

4.433001550952708

In [294]:
from sklearn.ensemble  import RandomForestRegressor
rr=RandomForestRegressor()
rr.fit(X,y)
submisiondata.Price=rr.predict(test_data)

In [ ]:
combineddata

In [ ]:
from sklearn.ensemble import StackingRegressor
from xgboost import XGBRegressor
from lightgbm import LGBMRegressor
from catboost import CatBoostRegressor

In [ ]:
xg=XGBRegressor(max_depth=3)
xg.fit(X,y)
mean_squared_error(y,xg.predict(X))

In [ ]:
lh=LGBMRegressor()
lh.fit(X,y)
submisiondata.Price=lh.predict(test_data)